module.exports = {
// يمكنك تخصيص اللغة هنا
autoUpdateThreadInfo: {},
checkwarn: {
text: {
warn: "تم تحذير العضو %1 ثلاث مرات مسبقًا وتم حظره من صندوق الدردشة\n- الاسم: %1\n- معرّف المستخدم: %2\n- لإلغاء الحظر ، يرجى استخدام الأسم “ %3warn unban <uid> (حيث يكون uid هو معرف المستخدم للشخص الذي تريد إلغاء حظره)",
needPermission: "يحتاج البوت إلى إذن المسؤول لطرد الأعضاء المحظورين"
}
},
leave: {
text: {
session1: "صباحًا",
session2: "ظهرًا",
session3:" مساءً",
session4: "مساءً",
leaveType1: "غادر المجموعة",
leaveType2: "تم طرده من المجموعة" 
}
},
logsbot: {
text: {
title: "====== سجلات البوت ======",
added: "\n✅\nالحدث: تمت إضافة البوت إلى مجموعة جديدة\n- تمت الإضافة بواسطة: %1",
kicked: "\n❌\nالحدث: تم طرد البوت\n- تمت الطرد بواسطة: %1",
footer: "\n- معرّف المستخدم: %1\n- المجموعة: %2\n- معرف المجموعة: %3\n- الوقت: %4"
}
},
onEvent: {},
welcome: {
text: {
session1: "صباحًا",
session2: "ظهرًا",
session3: "مساءً",
session4:" مساءً",
welcomeMessage: "شكرًا لدعوتي إلى المجموعة!\nبادئة البوت: %1\nلعرض قائمة الأوامر ، يرجى إدخال: %1help",
multiple1: "أنت",
multiple2: "أنتم"
}
}
}