module.exports = {
	config: {
		name: "اوامر", // Name of command, it must be unique to identify with other commands
		version: "1.0", // Version of command
		author: "NTKhang", // Author of command
		countDown: 5, // Time to wait before executing command again (seconds)
		role: 0, // Role of user to use this command (0: normal user, 1: admin box chat, 2: owner bot)
		shortDescription: {
			vi: "đây là mô tả ngắn của lệnh",
			en: "this is short description of command"
		}, // Short description of command
		longDescription: {
			vi: "đây là mô tả dài của lệnh",
			en: "this is long description of command"
		}, // Long description of command
		category: "categoryName", // Category of command
		guide: {
			vi: "đây là hướng dẫn sử dụng của lệnh",
			en: "this is guide of command"
		} // Guide of command
	},

	langs: {
		vi: {
			hello: "xin chào",
			helloWithName: "xin chào, id facebook của bạn là %1"
		}, // Vietnamese language
		en: {
			hello: "hello world",
			helloWithName: "hello, your facebook id is %1"
		} // English language
	},

	// onStart is a function that will be executed when the command is executed
	onStart: async function ({ api, args, message, event, threadsData, usersData, dashBoardData, globalData, threadModel, userModel, dashBoardModel, globalModel, role, commandName, getLang }) {
		// YOUR CODE HERE
      if(args[0] === 'المطور'){
    if(role === 2){
      const msg = `༺༽༺༺ المطور  ༻༻༼༻
         ✦✦✦✦✦✦✦✦✦✦✦
                ✧✧✧✧✧✧✧
القائمة: تغيير قائمة الأوامر 

غير_البروفيل: تغيير صورة ملف البوت

حدث: تعديل أوامر النظام

مجموعة: حظر المجموعات و فك الحظر

رستر_الكوفنج: إعادة رستر الكوفنج

رستر: إعادة رستر البوت

ادمن: إضافة وحذف أدمن في البوت

القفل: تغيير الصلاحيات 

صيانة: تفعيل وضع الصيانة 

فشخ  : مو مهم تعرف 🫥😉

update: ما ليك دخل 
تحديث: ينصح به عندما تغير الأدمن

تجربة: كود برمجي

تجاهل_عام: ماليك دخل 😌

srch:  ممنوع 
تنفيز: تنفيذ الأوامر

هنتاي: صور أنمي 

jjj:  ماليك دخل

grouptag: 

سبام: تدمير الجروب

شات: ذكاء اصطناعي

غادر: بيشرح حالو

كشف: كشف الملفات

تنظيف: تنظيف قاعدة البيانات

تبديل: تبديل حساب البوت

تفاعل: يتفاعل مع منشورات المطور

ضيفني: لا تهتم

ارفعني: لا تهتم

user: 

update: 

translate: 

shortcut: 

اعادة: اعادة تحميل الاوامر

adduser: 

event: 

ملف: ارسال وتغير واضافة وحذف الاوامر

  
-----------------المعلومات----------------

☆☆☆☆البوت به 150 امر☆☆☆☆
☆☆☆المطور:-ملك الجحيم ☆☆☆
_____________________________

اذا ما فهمت طريقة عمل امر محدد
 ☆ اكتب شرح واسم الامر مثال☆
            ☆ شرح ترحيب ☆
☆☆☆☆☆☆☆☆☆☆☆☆☆☆


شكرا لكم لاضافة بوت زكسل لجروبك
           يسعدني ان اساعدك
 
 ༺༺༺༺༻༻༻༻

 `
    message.reply(msg);
    }else{
      message.send('انا قلت اوامر المطور فقط 😑')
    }
  }else if(args[0] === 'اضافية'){
    
    const msg = `❥ـــــــــــــــــــــ♭ـــــــــــــــــــــ❥
      ‌❀❀  اوامر  اضافية  ❀❀
❥ــــــــــــــــــــ♭ــــــــــــــــــــــ❥

• دمج: دمج إيموجيهان 


• مشغول :  عدم الازعاج

• ويكي: البحث في ويكيبيديا 



• تيكتوك:  تنزيل الفديوهات دون 
علامة مائية 

• ترجم: ترجم نص

• معرف: رؤية الا id الخاص بك

• مسح: حذف رسائل البوت



• شرح :  يشرح طريقة عمل الامر

• الاوامر:  عرض قائمت الاوامر

• ابلاغ:  بلغ المطور لو في 
خطأ في البوت



• اقتباس: يرسل اقتباسات


• صورة: بحث عن صور




• مانجا: الحصول على معلومات المانجا



• قول: يحول رسالتك لصوت


• ناروتو: صور انمي





• الاسم: اكتب الاسم 


• اختار: اكتب اختار واحاجة او حاجة والبوت يختار



• videofb: ينزل فديوهات من الفيس

• أحاديث : يرسل احاديث


• صورة : يبحث في جوجل عن صور 


• غوجو : صور انمي


:::::::::::::::::✦المطور✦::::::::::::::::::
 

❥ـــــــــــــــــــــ♭ـــــــــــــــــــــ❥` 
    message.reply(msg);
  }else if(args[0] === 'الالعاب'){

    const msg = `❥ـــــــــــــــــــــ♭ـــــــــــــــــــــ❥
      ‌❀❀  اوامر  الالعاب  ❀❀
❥ــــــــــــــــــــ♭ــــــــــــــــــــــ❥

• ايموجي: 

• حزورة: 

• ترتيب: 

• عواصم: 

• اعلام: 


•كيف ساموت: 

•بروفايل: 

•اين ساسافر: 

•لو كنت شخصية انمي: 

•لو كنت شخصية حيوان: 

•لو كنت شخصية كرة: 


•سمسم : الدردشة بغباء الاصطناعي 

• قبلة : اكتب قبلة وتاغ لحببتك 

صفع : صفع وتاغ 
   
• زواج : وتاغ لزوجتك يا مشاكس

• هز: يرسل صورة حسابك!وهيا تهتز


• اتهام : اتهام وميمز @

• إنمي : يرسل صور انمي متحركة

• ضرب : ضرب للذكور فقط 


• قمامة :  سوي تاغ لشخص 
 
• زواج : الحصول على زوج

• الشذوذ : جرب تكتب الشذوذ ههه
 
•ملصق : الحصول على صورة عشوائي 


• آيدي : عرض معلوماتك



:::::::::::::::::✦المطور✦::::::::::::::::::
 

❥ـــــــــــــــــــــ♭ـــــــــــــــــــــ❥`
    message.reply(msg);
  }else if(args[0] === 'الادمن'){
    const msg = `❥ـــــــــــــــــــــ♭ـــــــــــــــــــــ❥
      ‌❀❀  اوامر  الادمن  ❀❀
❥ــــــــــــــــــــ♭ــــــــــــــــــــــ❥
• بوت :  ايقاف وتشغيل البوت 
في جروبك 

• تصفية: يتخلص من الحسابات 
المحظورة في جروبك 


• توديع:  تعديل نص عند خروج
شخص من جروبك 

• ترحيب:  يغير نص عند دخول 
شخص لجروبك 

• كنية : تعديل كنية الناس
 كل الجروب 

• منشن : تاغ للكل


• تحذير : تحذير أعضاء


• رد :  اضافة ردود يقولها البوت 
عندما تقول اسمك


• طرد : طرد عضو




• حظر : رد علي رسالة احد الاعضاء بكلمة ban والبوت ما يخلي شخص يرجعو لجروب


:::::::::::::::::✦المطور✦::::::::::::::::::
 

❥ـــــــــــــــــــــ♭ـــــــــــــــــــــ❥`
    message.reply(msg);
  }if (args[0]=== "المتجر"){

        message.reply(`❥ــــــــــــــــ♭ــــــــــــــــ❥
❀❀  اوامر المتجر  ❀❀
❥ـــــــــــــــ♭ـــــــــــــــــ❥

قم بكتابة متجر وراح تظهر لك اقسام الشراء 
ـــــــــــــــــــــــــــــــــــــــــ


اذا كنت تريد عرض شخصيتك اكتب 
=<<{  شخصيتي  }>>=

اذا تريد عرض لقبك اكتب 
   =<< {   لقبي   }>>=


اذا تريد عرض سلاحك اكتب 
=<<{   سلاحي   }>>=



اذا كنت تريد ربح النقاط كي تشتري اكتب 
    {   اوامر الالعاب   }

والعب حتا يشتري ما تحتاج


:::::::::::::✦المطور✦::::::::::::::
 

❥ــــــــــــــــ♭ــــــــــــــــ❥`)
      }else{return}
		

 }
};