module.exports = {
	config: {
		name: "تقرير", 
		version: "1.0", 
		author: "khir", 
		countDown: 5, 
		role: 0, 
		shortDescription: {
			vi: "đây là mô tả ngắn của lệnh",
			en: "  معلومات انمي"
		}, 
		longDescription: {
			vi: "đây là mô tả dài của lệnh",
			en: "معلومات انمي"
		},
		category: "categoryName",
		guide: {
			vi: "đây là hướng dẫn sử dụng của lệnh",
			en: "this is guide of command"
		} 
	},

	langs: {
		vi: {
			hello: "xin chào",
			helloWithName: "xin chào, id facebook của bạn là %1"
		}, // Vietnamese language
		en: {
			hello: "hello world",
			helloWithName: "hello, your facebook id is %1"
		} // English language
	},

	
	onStart: async function ({ api, args, message, event, threadsData, usersData, dashBoardData, globalData, threadModel, userModel, dashBoardModel, globalModel, role, commandName, getLang }){if (args[0] ==="معلومات"){message.send(`❥━──➸➽❥❂❥━──➸➽   
﴿معلومات عن الشخصيات   ﴾
اكتب تقرير واسم شخصية من الشخصيات التالية 

1:- كيزارو

2:- زورو

3:- نيزوكو

4:- فايوليت

5:- تانجيرو

7:- باجي

8:-  ليفاي

9:- ياغامي

10:- ساكورا

11:- ناروتو 
❥━──➸➽❥❂❥━──➸➽`)}if (args[0] ==="باجي"){ 
		 var link = ["https://i.ibb.co/G7vL5Sz/xva213.jpg","https://i.imgur.com/msPsYTV.jpg"] ;

let img = link[Math.floor(Math.random()*link.length)]
message.send({body :`❥━──➸➽❥❂❥━──➸➽ 
﴿تقرير عن شخصيه باجي كيسكي او كيسكي باجي 
الاسم بالعربي: باجي كيسكي
الاسم بالانجليزي : Baji Keski
الانمي : Tokyo revengers
العمر : 15 
الجنس : ذكر 
العصابة : طوكيو مانجي _ فالهالا 
نبذه عن الشخصية :
باجي كيسكي او كيسكي باجي كلو واحد هو تاني اكثر شخصيه محبوبة في انمي طوكيو ريفينجرز هو احد افراد عصابة طوكيو مانجي و قائد الفرقة الاولى و لكنه انفصل عن تومان و انضم الي عصابة فالهالا كان باجي يعمل كجاسوس في عصابة فالهالا لانه كان على شك في امر كيساكي تيتا زعيم عصابة فالهالا لهذا غادر باجي تومان فقط ليحمي اصدقائة .
مات باجي عندما قام بطعن نفسة لحماية كازتورا في اثناء معركة تومان و فالهالا (تقريبا الحلقة 21 ) . 
باجي فتى معقد يصعب فهم ما يدور في رأسه رغم عصبيتة و انفعاله الشديد الا انه يفعل كل شي فقط من اجل حماية اصدقائة يمتلك باجي شخصية هادئة و عنيفة و متهورة حيث ذكر مايكي (زعيم عصابة تومان ) انه قام بحرق سيارة فقط لانه كان جائع لهذا لا يتم دعوتة في اجتماعات العصابة .
مظهر الشخصية :
باجي مراهق في عمر 15 يبلغ طوله حوالي 176cm لدى باجي شعر طويل اسود اللون عادة ما يقوم بشده و ربطة اثناء القتالات و ذلك الي جانب عينيه البنيتين و يمتلك انياب بارزة عادة ما يرتدي زي الفرقة الاولى لتومان و زي فالهالا . 
تشوفيو ماتسونو و هو اعز اصدقاء باجي و الاقرب اليه كما انه ايضا نائب باجي اي نائب الفرقة الاولى ﴾
❥━──➸➽❥❂❥━──➸➽`,
 attachment: await global.utils.getStreamFromURL(img)})}if (args[0] ==="ياغامي"){ 
		 var link = ["https://i.ibb.co/cy7zRb1/xva213.jpg"] ;

let img = link[Math.floor(Math.random()*link.length)]
message.send({body :`❥━──➸➽❥❂❥━──➸➽ 
تقرير عن شخصية ياغامي لايت:-
يتميز لايت بالغموض الشديد حتى صار شخصية محبوبة جدا كان هدفه الوحيد هو تغيير العالم الحالي وأن يكون له قوة خارقة يستطيع من خلالها الحكم للعالم كله ، وهو شاب يافع في ريعان شبابه قد مل من كل أوضاع العالم التي حوله حتى أنه وجد مذكرة صغيرة تسمى مذكرة الموت ، فأي شخص يكتب اسمه بداخل هذه المذكرة يموت على الفور ولكنه لم يصدق هذه المذكرة وقام بإلقاءها حتى استطاع أن ىيكشف لغزها
❥━──➸➽❥❂❥━──➸➽`,
 attachment: await global.utils.getStreamFromURL(img)})}if (args[0] ==="فايوليت"){ 
		 var link = ["https://i.ibb.co/8YkPWz8/xva213.jpg"] ;

let img = link[Math.floor(Math.random()*link.length)]
message.send({body :`❥━──➸➽❥❂❥━──➸➽ 
﴿ *تقرير عن شخصية فايوليت

_معلومات عامة عن الشخصية:

_ إسمها بالعربي : فايوليت افريغاردين

_بالإنجليزي : Violet evergarden

_و بالياباني : バイオレットエバーガーデン

الأنمي : ...........

الجنس : انثى( فتاة)

_عمرها : ما بين15-16 سنة

_دورها : دمية ذكريات ذاتية

_الحالة : على قيد الحياة

_ مؤدية الصوت: يوي إيشيكاوا.
 ◎ ══════ ❈ ══════ ◎

_مواصفات الشخصية:

فيوليت فتاة ذات بشرة بيضاء كالثلج , لها شعر أشقر أشبه بالذهب عيناها زراقاوتان 
 و تعبر شخصية مراعية للغير و متفهمة جدا ,و تتعامل مع غيرها بطيبة و حساسة جدا و... باختصار هي شخص مميز ^^
◎ ══════ ❈ ══════ ◎
_ماضي الشخصية:

عموما ماضيها يعتبر غامض لم يذكر عنه شي سوا انه 
 و هي طفلة وجدها ضابط البحرية ديتفريد بوغانفيليا في جزيرة أين هبط مجبرا و طاقمه بها حينها (بلاقاىهما طبعا مع مرور الأحداث )أدرك مهاراتها القتالية فاخذها معه و لاحقا أهداها لأخيه بمناسبة ترقيته.... و قد عملت معه كجُندية في الحرب مع الرائد غيلبِرت بوغانفيلاي , لكن مع نهاية الحرب أصيب الرائد بإصابة شديدة , وكان على شفار الموت , فقال لفيوليت: عيشي حرة , وقال لها: أحبك , لكنها لم تفهم معنى كلمة "أحبك" و من هنا تبدأ رحلتها و هي حرة باحثة عن معنى الكلمة و عن نفسها و هي تعتبر شخصية رئيسية. ﴾
❥━──➸➽❥❂❥━──➸➽`,
 attachment: await global.utils.getStreamFromURL(img)})}if (args[0] ==="زورو"){ 
		 var link = ["https://i.ibb.co/Cwb1bzS/xva213.jpg"] ;

let img = link[Math.floor(Math.random()*link.length)]
message.send({body :`❥━──➸➽❥❂❥━──➸➽   
رورونوا زورو (باليابانية: ロロノア・ゾロ)، إحدى الشخصيات الأساسية في مانغا ون بيس التي من تاليف إييتشيرو أودا. وهو أول من انضم إلى لوفي، ويعتبر مقاتل طاقم قراصنة قبعة القش. وهو سياف طاقم قبعة القش ويستخدم تقنية الثلاث سيوف التي طورها بنفسه يتمتع بقوة بدنية كبيرة وقدرة هائلة على التحمل
رورونوا زورو

￼

المسلسلون بيسالملف الشخصيالجنسذكر  [لغات أخرى] ‏  ￼العالم الخياليعالم ون بيس  [لغات أخرى] ‏  ￼تاريخ الميلاد11 نوفمبرالمهنةسياف  [لغات أخرى]‏،  وقرصان  [لغات أخرى] ‏،  وصائد مكافآت  [لغات أخرى]‏  ￼معلومات النشرالظهور الأولالمانغا: الفصل الثالث

الأنمي: الحلقة الثانيةالصوت بواسطةالياباني: كازويا ناكاي 

زورو الصغير: ميغومي أوراوا

العربي: مروان فرحات 

زورو الصغير: سمر كوكشعضو فيقراصنة قبعة القش  [لغات أخرى] ‏  ￼معلومات أخرىالمكافآت

الأولى: 60,000,000 ￼

الثانية: 120,000,000 ￼

الثالثة: 320,000,000 ￼معلومات على الويبIMDb.comch0947176  ￼تعديل مصدري - تعديل ￼

السيرة الذاتيةعدل

الاسم: رورونوا زورو (مُقتبس من اسم القرصان الفرنسي الشهيرفرانسوا لولونييه)

العمر:

19 عاماً (قبل السنتين)

21 عامًا (بعد السنتين)

الأسلحة:

مُستخدم للهاكي (التسلح + الملاحظة + الملكي)

يستخدم أسلوب 3 سيوف في القتال.

تاريخ الميلاد: 11 نوفمبر

الطول:

178 سم (قبل السنتين)

181 سم (بعد السنتين)[1][2]

الطعام المفضل: الأرز الأبيض وسمك ملك البحر والخمر «الساكي»

المكافأة الموضوعة على رأسه: 1,111,000,000 ￼

الوظيفة في الطاقم: السّياف، العديد من متابعي ون بيس يرونه كمساعد لوفي الأيمن.

أول ظهور له:

المانجا – الفصل الثَّالث

الأنمي – الحلقة الثَّانية

ألقابه:

صائد القراصنة (الحكومة العالمية)

ماريمو، وتعني رأس الطحلب (سانجي)

السيد بوشيدو (فيفي)

السيد السياف (نيكو روبين)

مؤدي الصوت الياباني:

كازويا ناكاي

ميجومي أوراوا (زورو الصغير)[3]

صفاته المميزة: حس المغامرة، القوة، الذكاء في القتال، الشجاعة، اللامبالاة، النوم، فاقد الإحساس بالاتجاهات.

شخصيتهعدل

رورونوا زورو شخصية في الأنمي المشهور ون بيس وهو فرد من طاقم قراصنة قبعة القش.
أثناء مشاهدة الأنمي وقراءة المانجا يستغرب المتابع من قوة زورو الشديدة للتحمل التي تضاهي أو تفوق قدرة قبطان السفينة مونكي دي لوفي. زورو ظهر أكثر من مرة وهو يتلقى ضربات يظن من يراها تلقن إليه بأنه سيموت لا محالة أو أنه سيصاب بشلل أو إعاقة دائمة لكنه دائماً يشفى كأن شيءً لم يكن. حتى أن قوته الجسمية مثيرة للعجب فمعظم أقوى أقوياء عالم ون بيس اكتسبوا قوتهم من فاكهة الشيطان إلَّا أن زورو يعود فضل قوته لتدريباته الشاقة المتواصلة. تبدو على وجه زورو ملامح الغضب والاستياء والجدية لكنه عادةً طيب وظهر أكثر من مرة حرصه الشديد على أصدقائه حتى أكثر من حرصه على نفسه. كما أن زورو يعد مساعد القبطان الأيمن وهو عادةً من يرشد الكابتن إلى الصحيح من الفعل. زورو رجل يحكم بعقله وعادةً يميز الصواب من الخطإ ويفعل الصواب مهما كانت تكلفته
❥━──➸➽❥❂❥━──➸➽`,
 attachment: await global.utils.getStreamFromURL(img)})}if (args[0] ==="نيزوكو"){ 
		 var link = ["https://i.ibb.co/r6gZr8S/xva213.jpg"] ;

let img = link[Math.floor(Math.random()*link.length)]
message.send({body :`❥━──➸➽❥❂❥━──➸➽   
❖┇تقرير عن شخصية نيزوكو كامادو┇❖
اسم الانمي: قاتل الشياطين
الاسم بالانجليزية: demon slayer
الاسم بالياباني: 鬼滅尾の。やいぱ
حالة الانمي: مستمر
تصنيف العمر: 17+
عدد المواسم: 2
مدة الحلقة: 24د
اسم الشخصية نيزوكو كامادو
اسم الشخصية ب الانكليزية: Neezuoko kamado
اسم الشخصية ب اليابانية: ねえずおこかまど

❖┇قصة الشخصية┇❖

كإنسان كانت شخصية لطيفة و مراعية و تفكر في الآخرين وهي المسؤولة عن اشقائها الصغار.

كشيطان قد نسيت جزء كبير من ذكرايتها كإنسان الي جانب تلك المتعلقة باسرتها انها لاتزال مهتمة بحماية البشر الذين تعتبرهم من أفراد اسراتها وذالك بسب تأثير اوروكوداكي أثناء نومها لمدة عامين.

نشأت نيزكو على جبل مع شقيقها الأكبر تانجرو و أمه و اشقائها الصغار هي الابنة الأكبر لعائلة كامودو من المفترض انها اعتنت باخوتها الصغار كامساعدة لأمها، كما شهدنا لفترة وجيزة قبل وفاة عائلتها.

❅ ━━━━ » ✥ « ✇ » ✥ « ━━━━ ❅

‏•【 فقرة 】 • 

⊱━─━─•⊱≼✿≽⊰•─━─━

⊱━─━─•⊱≼✿≽⊰•─━─━⊰

❅ ━━━━ » ✥ « ✇ » ✥ « ━━━━ ❅

على عكس تانجيرو الذي كان مسؤولآ عن بيع الحطب في المدينة، كانت الأسرة فقيره الي حد ما ونتيجة ذالك اضطرت نيزكو في بعض الأحيان الي الذهاب دون اشياء مثل الملابس الجديدة من أجل ضمان ان بقية أخواتها ليس لديهم مايكفي من طعام لتناوله،لم يبدو أنها تنظر إلى ذالك كعبئ وبدلا من ذالك كانت راضية عن مساعدة اسراتها.

بعد أن قتل شيطان عائلتها تحولت نيزكو الي شيطانة نتيجة الهجوم، في البداية كانت وحشية الي حد ما. هجمت على شقيقها الوحيد المتبقي، ومع ذالك جائت بسرعة الي رشدها ودافعت عنه من توميوكا غيو منذ ذالك الحين سافرت مع شقيقها لاتصبح انسانة مرة .
❥━──➸➽❥❂❥━──➸➽`,
 attachment: await global.utils.getStreamFromURL(img)})}if (args[0] ==="ليفاي"){ 
		 var link = ["https://i.ibb.co/442cCGw/xva213.jpg"] ;

let img = link[Math.floor(Math.random()*link.length)]
message.send({body :`❥━──➸➽❥❂❥━──➸➽   
تقرير عن ليفاي أكرمان 
.بطلب من Møhâmmęď Đď

🔰المعلومات الشخصية: 

الاسم : ليفاي 

  الجنس : ذكر

أول ظهور: الموسم الاول الحلقة 11

 النوع : بشري

 الطول: 160 cm

الانتماء : فيلق الاستطلاع 

  الحالة : حي

🔰نبذة :
أقوى جندي للبشرية  

🔰المظهر الخارجي: 
قصير  الطول  ،، لديه شعر قصير أسود المقدمة  ،، عيناه سوداء   ،، يمتلك ملامح شاب لا تناسب عمره وبقي محافظا على شكله حتى الحلقة الأخيرة 

🔰الشخصية: 
ولد في بيئة مليئة بالدم و القتل ماتت أمه أمام عينه و رباه خاله السفاح كيني مدة و تخلى عنه وإنضم لفيلق الاستطلاع من قبل إيروين سميث بدأ كشخص ضعيف إلى أن أصبح أقوى جندي في تاريخ البشرية 

🔰أبرز ما جاء في المسيرة :
•هزم وأهان العملاق الوحش مرتين

•أكبر عامل لاستعادة شينغاشيا بعد إيرين 

•شارك في اقتحام مارلي 

•تعاون مع الفيلق لتبرئة إسمهم  

• قتل 30 عملاق في أقل من دقيقه 

• أخضع المارليين لتأسيس جيش التحالف 

•لديه محاولات فاشلة في قتل زييك 

🔰أبرز المقولات: 
"تخلى عن حلمك و مت 
يجب أحيانا تلطيخ يدنا بدماء من أجل البشرية 

•لم يكن لايسياما نية ليصبح شخصية رئيسية لكنه شعر بضرورة وجود شخصية لها شعبية أكثر من البطل
أي شخصية تريدون تقرير عنها من دون ميكاسا
✦ـــــــــــــــــــــــــــــــــــــــــــــ✦
❥━──➸➽❥❂❥━──➸➽`,
 attachment: await global.utils.getStreamFromURL(img)})}if (args[0] ==="كيزارو"){ 
		 var link = ["https://i.ibb.co/09Rg1Z3/xva213.jpg"] ;

let img = link[Math.floor(Math.random()*link.length)]
message.send({body :`❥━──➸➽❥❂❥━──➸➽   
تقرير عن شخصية كيزارو

| الإسم : كيزارو |::

::| معنى الإسم : القرد الأصفر |::

::| الإسم الحقيقي : بورسالينو |::

::| الإسم بالإنجليزية : KIZARU |::

::| أول ظهور في الأنمي : حلقة 398 |::

::| أول ظهور في المانجا : شابتر 504 |::

::| الإنتماء : المارينز |::

::| المهنة : أدميرال |::

::| العمر : 42 |::

::| الوزن : 98 كيلو جرام |::

::| فاكهة الشيطان : بيكا بيكا نو مي |::

::| نوع الفاكهة : لوقيا |::
كيزارو هو أحد الأدميرالات الثلاث للبحرية اسمه الحقيقي هو بورسالينو و هو يعد من الشخصيات الأساسية في أحداث أرخبيل شابوندي و هو شخصية تستحق انه يكون لها تقرير لما تحتويه من اسرار و قوة .
كيزارو رجل طويل القامة يملك قدمان طويلتان و يبدو أنه أكبر سناً من الأدميرالات الآخرين ( أكاينو , أوكيجي ) بسبب إمتلاكه الكثير من التجاعيد في وجهه و لدى كيزارو أيضاً لحية و شارب خفيفان و يرتدي نظارة صفراء ذهبية اللون كما يملك سوالف طويلة و هو غالباً ما يفتح فمه و يحرك شفتيه بطريقة غريبة .
يرتدي كيزارو بدلة مخططة باللون الأبيض و الأصفر و قميص أزرق و ربطة عنق بنفسجية كما يرتدي معطف بحرية على كتفيه و يرتدي حذاء أبيض ناصع البياض و يملك دن دن موشي أسود على معصمه الأيسر .
 كيزارو شخصية هادئة جداً و لا يتأثر بالأشياء التي تحدث حوله فعندما نزل إلى أرخبيل شابوندي أطلق قرصاناً على رأسه رصاصاً و رغم أنها إخترقت رأسه إلا أنه إستمر بالكلام في الدن دن موشي و هو أيضاً يتكلم ببطئ مما يدل على اللامبالاة و الكسل و هو يقلل و يستهزء بأعدائه و لا تظهر عليه ملامح الخوف منهم حتى من الوايت بيرد و يبدو أنه يحب ان ينادى بإسمه الحقيقي " بورسالينو " و هو لا يظهر أي رحمة للقراصنة مهما كانوا ضعفاء و لكن بسبب كسله قد يحظى بعض القراصنة ببعض من الرحمة مثل ما فعل مع قراصنة القلب و لوفي عندما حاولوا الهروب من المارين فورد

لم يذكر شئ عن ماضي كيزارو ولكنه ظهر عندما كان سينجوكو وجارب يتفقان على على ما سيفعلانه لكي يوقفوا الحرب بين روجر و شيكي.
❥━──➸➽❥❂❥━──➸➽`,
 attachment: await global.utils.getStreamFromURL(img)})}module.exports = {
	config: {
		name: "تقرير", 
		version: "1.0", 
		author: "NTKhang", 
		countDown: 5, 
		role: 0, 
		shortDescription: {
			vi: "đây là mô tả ngắn của lệnh",
			en: "this is short description of command"
		}, 
		longDescription: {
			vi: "đây là mô tả dài của lệnh",
			en: "this is long description of command"
		},
		category: "categoryName",
		guide: {
			vi: "đây là hướng dẫn sử dụng của lệnh",
			en: "this is guide of command"
		} 
	},

	langs: {
		vi: {
			hello: "xin chào",
			helloWithName: "xin chào, id facebook của bạn là %1"
		}, // Vietnamese language
		en: {
			hello: "hello world",
			helloWithName: "hello, your facebook id is %1"
		} // English language
	},

	
	onStart: async function ({ api, args, message, event, threadsData, usersData, dashBoardData, globalData, threadModel, userModel, dashBoardModel, globalModel, role, commandName, getLang }) { if (args[0] ==="باجي"){ 
		 var link = ["https://i.ibb.co/G7vL5Sz/xva213.jpg","https://i.imgur.com/msPsYTV.jpg"] ;

let img = link[Math.floor(Math.random()*link.length)]
message.send({body :`❥━──➸➽❥❂❥━──➸➽ 
﴿تقرير عن شخصيه باجي كيسكي او كيسكي باجي 
الاسم بالعربي: باجي كيسكي
الاسم بالانجليزي : Baji Keski
الانمي : Tokyo revengers
العمر : 15 
الجنس : ذكر 
العصابة : طوكيو مانجي _ فالهالا 
نبذه عن الشخصية :
باجي كيسكي او كيسكي باجي كلو واحد هو تاني اكثر شخصيه محبوبة في انمي طوكيو ريفينجرز هو احد افراد عصابة طوكيو مانجي و قائد الفرقة الاولى و لكنه انفصل عن تومان و انضم الي عصابة فالهالا كان باجي يعمل كجاسوس في عصابة فالهالا لانه كان على شك في امر كيساكي تيتا زعيم عصابة فالهالا لهذا غادر باجي تومان فقط ليحمي اصدقائة .
مات باجي عندما قام بطعن نفسة لحماية كازتورا في اثناء معركة تومان و فالهالا (تقريبا الحلقة 21 ) . 
باجي فتى معقد يصعب فهم ما يدور في رأسه رغم عصبيتة و انفعاله الشديد الا انه يفعل كل شي فقط من اجل حماية اصدقائة يمتلك باجي شخصية هادئة و عنيفة و متهورة حيث ذكر مايكي (زعيم عصابة تومان ) انه قام بحرق سيارة فقط لانه كان جائع لهذا لا يتم دعوتة في اجتماعات العصابة .
مظهر الشخصية :
باجي مراهق في عمر 15 يبلغ طوله حوالي 176cm لدى باجي شعر طويل اسود اللون عادة ما يقوم بشده و ربطة اثناء القتالات و ذلك الي جانب عينيه البنيتين و يمتلك انياب بارزة عادة ما يرتدي زي الفرقة الاولى لتومان و زي فالهالا . 
تشوفيو ماتسونو و هو اعز اصدقاء باجي و الاقرب اليه كما انه ايضا نائب باجي اي نائب الفرقة الاولى ﴾
❥━──➸➽❥❂❥━──➸➽`,
 attachment: await global.utils.getStreamFromURL(img)})}if (args[0] ==="ياغامي"){ 
		 var link = ["https://i.ibb.co/cy7zRb1/xva213.jpg"] ;

let img = link[Math.floor(Math.random()*link.length)]
message.send({body :`❥━──➸➽❥❂❥━──➸➽ 
تقرير عن شخصية ياغامي لايت:-
يتميز لايت بالغموض الشديد حتى صار شخصية محبوبة جدا كان هدفه الوحيد هو تغيير العالم الحالي وأن يكون له قوة خارقة يستطيع من خلالها الحكم للعالم كله ، وهو شاب يافع في ريعان شبابه قد مل من كل أوضاع العالم التي حوله حتى أنه وجد مذكرة صغيرة تسمى مذكرة الموت ، فأي شخص يكتب اسمه بداخل هذه المذكرة يموت على الفور ولكنه لم يصدق هذه المذكرة وقام بإلقاءها حتى استطاع أن ىيكشف لغزها
❥━──➸➽❥❂❥━──➸➽`,
 attachment: await global.utils.getStreamFromURL(img)})}if (args[0] ==="فايوليت"){ 
		 var link = ["https://i.ibb.co/8YkPWz8/xva213.jpg"] ;

let img = link[Math.floor(Math.random()*link.length)]
message.send({body :`❥━──➸➽❥❂❥━──➸➽ 
﴿ *تقرير عن شخصية فايوليت

_معلومات عامة عن الشخصية:

_ إسمها بالعربي : فايوليت افريغاردين

_بالإنجليزي : Violet evergarden

_و بالياباني : バイオレットエバーガーデン

الأنمي : ...........

الجنس : انثى( فتاة)

_عمرها : ما بين15-16 سنة

_دورها : دمية ذكريات ذاتية

_الحالة : على قيد الحياة

_ مؤدية الصوت: يوي إيشيكاوا.
 ◎ ══════ ❈ ══════ ◎

_مواصفات الشخصية:

فيوليت فتاة ذات بشرة بيضاء كالثلج , لها شعر أشقر أشبه بالذهب عيناها زراقاوتان 
 و تعبر شخصية مراعية للغير و متفهمة جدا ,و تتعامل مع غيرها بطيبة و حساسة جدا و... باختصار هي شخص مميز ^^
◎ ══════ ❈ ══════ ◎
_ماضي الشخصية:

عموما ماضيها يعتبر غامض لم يذكر عنه شي سوا انه 
 و هي طفلة وجدها ضابط البحرية ديتفريد بوغانفيليا في جزيرة أين هبط مجبرا و طاقمه بها حينها (بلاقاىهما طبعا مع مرور الأحداث )أدرك مهاراتها القتالية فاخذها معه و لاحقا أهداها لأخيه بمناسبة ترقيته.... و قد عملت معه كجُندية في الحرب مع الرائد غيلبِرت بوغانفيلاي , لكن مع نهاية الحرب أصيب الرائد بإصابة شديدة , وكان على شفار الموت , فقال لفيوليت: عيشي حرة , وقال لها: أحبك , لكنها لم تفهم معنى كلمة "أحبك" و من هنا تبدأ رحلتها و هي حرة باحثة عن معنى الكلمة و عن نفسها و هي تعتبر شخصية رئيسية. ﴾
❥━──➸➽❥❂❥━──➸➽`,
 attachment: await global.utils.getStreamFromURL(img)})}
	}
};
	}
};