module.exports = {
	config: {
		name: "متجر", 
		version: "1.0", 
		author: "NTKhang", 
		countDown: 5, 
		role: 0, 
		shortDescription: {
			vi: "đây là mô tả ngắn của lệnh",
			en: "this is short description of command"
		}, 
		longDescription: {
			vi: "đây là mô tả dài của lệnh",
			en: "this is long description of command"
		},
		category: "categoryName",
		guide: {
			vi: "đây là hướng dẫn sử dụng của lệnh",
			en: "this is guide of command"
		} 
	},

	langs: {
		vi: {
			hello: "xin chào",
			helloWithName: "xin chào, id facebook của bạn là %1"
		}, // Vietnamese language
		en: {
			hello: "hello world",
			helloWithName: "hello, your facebook id is %1"
		} // English language
	},

	
	onStart: async function ({ api, args, message, event, threadsData, usersData, dashBoardData, globalData, threadModel, userModel, dashBoardModel, globalModel, role, commandName, getLang }) { if (typeof args[0] === "undefined" || args[0] === "") {
 message.send(`❥ــــــــــــــــ♭ــــــــــــــــ❥
❀❀ قائمت المتجر ❀❀
❥ــــــــــــــــ♭ــــــــــــــــ❥
متجر الشخصيات 

متجر الاسلحة 

متجر الالقاب 
❥ــــــــــــــــ♭ــــــــــــــــ❥

كل متجر يظهر قائمت
 الشخصيات والثمن الخاص 
بها اجمع نقاط واشتري

 {شخصيات}

 {الاسلحة}

 {الالقاب}



❥ــــــــــــــــ♭ــــــــــــــــ❥`);
} if (args[0]=== "الاسلحة"){message.send(`❥━──➸➽❥❂❥━──➸➽ 
 شراءالاسلحة الاسطورية ﴾


 } قسم السيوف {

سيف الجحيم { 306 نقطة}


سيف البوابة {350 نقطة}

سيف الهدوء {769 نقطة}

سيف الدماء { 670 نقطة}

سيف الظلال { 505 نقطة}

سيف الجحيم الاسود {700 نقطة}

ســيــف الموت {400 نقطة}

ســيــف المحبة {300 نقطة}

سيف العين {600 نقطة}

سيف الهلاك {698 نقطة}

سيف النصر {588 نقطة}


 } قسم الشوركن {

 شوريكن الجحيم { 800 نقطة}

شوركن الملوك {76 نقطة}

شوريكن الهدوء {39 نقطة}

 } قسم المناجل {

منجل الملوك { 1000 نقطة}

منجل المدمر {700 نقطة}

منجل المتلاعب {97 نقطة}

منجل الظلام { 769 نقطة}

منجل الهيكل {500 نقطة}

منجل القاطع {76 نقطة}

منجل الغراب { 46 نقطة}

منجل الهدوء {69 نقطة}

منجل الكره {370 نقطة}





❥━──➸➽❥❂❥━──➸➽

لشراء السلاح اكتب 

شراء سلاح واسم السلاح 

مثال:- 

شراء سلاح سيف الجحيم

شراء سلاح منجل الظلام

شراء سلاح شوريكن الجحيم

❥ــــــــــــــــ♭ــــــــــــــــ❥`)}
if (args[0]==="الشخصيات"){message.reply(`❥━──➸➽❥❂❥━──➸➽ 
 ﴿قائمت الشخصيات ﴾


ايرين {928 نقطة}

اكازا {675 نقطة}

مايكي {458 نقطة}

هيسوكا {680 نقطة}

بوروتو {10 نقطة}

باين {800 نقطة}

بروك {750 نقطة}

ناروتو {980 نقطة}

سانجي {200 نقطة}

يامي {300 نقطة}

غوجو {700 نقطة}

تانجيرو {960 نقطة}

كيلوا {670 نقطة}

زورو {600 نقطة}

لوفي {506 نقطة}

ايتادوري {409 نقطة}

ايتاشي {1000 نقطة}

كاكاشي {400 نقطة}

غوكو {900 نقطة}

لاو {169 نقطة}

ايرين {580 نقطة} 

❥━──➸➽❥❂❥━──➸➽
 اكتب عرض واسم الشخصية وسيتم ارسال صورتها

مثال :-
 عرض صورة ايتاشي 

اكتب شراء شخصية واسم الشخص 

مثال :- 

شراء شخصية ايتاشي

 
❥━──➸➽❥❂❥━──➸➽`)}if (args[0] ==="الالقاب"){message.send(`❥━──➸➽❥❂❥━──➸➽ 
 ﴿شرا الالقاب الاسطورية ﴾


 ﴿القاب الاولاد﴾
وحش كونها {30 نقطة}

حاكم المسارات {70 نقطة}

الجوكر {100 نقطة}

الثعلب الناري {110 نقطة}

الذئب الفضي {90 نقطة}

ملك الظلام {120 نقطة}

سيف الجحيم {40 نقطة}

جراح الموت {29 نقطة}

العنقاء الجارحة {80 نقطة}

المهرج الغاضب {40 نقطة}

عين الصقر {190 نقطة}

الهوكاغي { 126 نقطة}

سيد العناصر {180 نقطة}

ملك الوحوش {500 نقطة}

الحامي الاعظم {400 نقطة}


 ﴿القاب البنات﴾


دموع القمر {97 نقطة}


غيومي غطت عيوني {66 نقطة}


سفينة بلا شراع {57 نقطة}


فقيدة القلب {75 نقطة}

زهرة العذاب {69 نقطة}


أسيرة الأحزان {1 نقطة}


حروف صامتة {42 نقطة}


مذكرات محزنة {8 نقطة}


صمتي لغتي {80 نقطة}


سنابل مكسورة {12 نقطة}


أميرة في دنيا حقيرة {100 نقطة}


ملكة العذاب {500 نقطة}


حياتي هَلْاكي {200 نقطة}


هجرت الروح {38 نقطة}


دموع حائرة {39 نقطة}


صرخة ألم {47 نقطة}


صرخة حرمان {36 نقطة}


لحظة خداع {91 نقطة}


وهم وانكسار {37 نقطة}


ملامح مزيفة {508 نقطة}


حب وخداع {39 نقطة}


الحزن عنواني {145 نقطة}


اقــنعهۂ مستعـارهۂ {13 نقطة}
 
❥━──➸➽❥❂❥━──➸➽

لشراء اللقب اكتب 

شراء لقب واسم اللقب 

مثال:- 

شراء لقب وحش كونوها 
 

❥ــــــــــــــــ♭ــــــــــــــــ❥`)}
		

	}
};